#include "stdafx.h"

#include "../System/BoundCalcer.h"
#include "../System/lerp.h"
#include "../System/staticvector.h"

#include "../System/InlineProfiler.h"

#include "ParticleFX.h"
#include "debugrenderer.h"
#include "ConvexVolume.h"
#include "batch.h"
#include "renderresourcemanager.h"
#include "SkeletalMesh.h"
#include "smartrenderer.h"
#include "sceneconstants.h"
#include "SkeletonWrapper.h"
#include "GlobalMasks.h"
#include "../MeshConverter/ParticleNewHeader.h"
#include "DXUtils.h"
#include "IConfigManager.h"

static const short g_ParticlePivotOffset = 16380;
static const int   MAX_PARTICLES = 8192; // Up to 16K

static bool g_rndSwitch_PFX = true;
REGISTER_DEV_VAR( "rnd_PFX", g_rndSwitch_PFX, STORAGE_NONE );

//static bool s_dbgEatMemory = false;
//REGISTER_DEV_VAR( "debug_EatMemory", s_dbgEatMemory, STORAGE_NONE );

static NDebug::DebugVar<int> render_PFX_Update( "PFX_Update", "PerfCnt", true );
static NDebug::DebugVar<int> render_PFX_Render( "PFX_Render", "PerfCnt", true );
static NDebug::DebugVar<int> render_PFX_Count( "PFX_Count", "PerfCnt", true );
static NDebug::DebugVar<int> render_PFX_VBSize( "PFX_VBSize", "PerfCnt", true );
static NDebug::AverageDebugVar<int> render_PFX_AvgCount( "PFX_CountAvg", "PerfCnt" );

static NDebug::PerformanceDebugVar render_PFX_UpdateTime( "PFX_UpdateTime", "PerfCnt", 10, 10, true );

//static bool useHWInstancing = true;
//REGISTER_DEV_VAR("useHWI", useHWInstancing, STORAGE_NONE)

#define useHWInstancing (!Compatibility::IsRunnedUnderWine())

DECLARE_NULL_RENDER_FLAG

template<class T>
__forceinline bool chain_less(T _lhs, T _rhs, bool _next = false)
{
  if(_lhs == _rhs)
    return _next;
  else
    return _lhs < _rhs;
}

namespace Render
{

struct ParticleVertexSW
{
  CVec3 Position;         //12
  CVec3 Direction;        //12
  CVec4 UV;               //16
  CVec3 RotationAndSize;  //12
  CVec4 Color;            //16
};

struct ParticleVertexHW
{
  CVec4 PositionAndID;      //16
  CVec4 DirectionAndOrient; //16
  CVec4 UV;                 //16
  CVec3 RotationAndSize;    //12
  CVec4 Color;              //16

  ParticleVertexHW(ParticleVertexSW const &_src, float _pfxID, float _orient)
    : PositionAndID(_src.Position, _pfxID), DirectionAndOrient(_src.Direction, _orient)
    , UV(_src.UV), RotationAndSize(_src.RotationAndSize), Color(_src.Color)
  {}
};

struct ParticleVertexHWnoHWI : ParticleVertexSW
{
  DWORD CornerMasks;
};

static const int SW_PART_SIZE = sizeof(ParticleVertexSW);

struct ParticleIndex
{
  int   indices;  // ID of particle + (ID of particle system in MSByte)
  float distance;

  bool operator<(const ParticleIndex& v) const
  {
    return distance > v.distance;
  }
};

struct CompositeParticleIndex : ParticleIndex
{
  static int const SUBPRIORITY_SHIFT = (8 * sizeof(int) - Material::SUBPRIORITY_SIZE);
  static int const SYS_ID_SIZE = 9;
  static int const PART_ID_SIZE = SUBPRIORITY_SHIFT - SYS_ID_SIZE;
  static int const SUBPRIORITY_MASK = -1 << SUBPRIORITY_SHIFT;
  static int const SYS_ID_MASK = (1 << SYS_ID_SIZE) - 1;
