<!DOCTYPE HTML>
<html lang="en-US">
<head>
   <meta charset="UTF-8">
   <title></title>
</head>
<body>
<p><i><span style='font-style:italic'>Le pr&eacute;sent document est une traduction en fran&ccedil;ais du document se
trouvant &agrave; l'adresse <a href="http://www.nival.com/tos-us.html#!/tos-us.html">http://www.nival.com/tos-us.html#!/tos-us.html</a>. En cas de contradiction entre la
version anglaise de ce document et la pr&eacute;sente traduction, la version
anglaise pr&eacute;vaudra juridiquement. Seule la version du pr&eacute;sent
document situ&eacute;e &agrave; l'adresse <a href="http://www.nival.com/tos-us.html#!/tos-us.html">http://www.nival.com/tos-us.html#!/tos-us.html</a> n’a de valeur juridique.</span></i></p>

<p>&nbsp;</p>

<h1>NIVAL, INC.</h1>

<h1>CONDITIONS D'UTILISATION</h1><br>
<br>

<p><b>Date d'entr&eacute;e en vigueur&nbsp;: </b>28 avril 2014</span></font></p>

<h2>1. ACCORD</h2>

<p>Les modalit&eacute;s du pr&eacute;sent accord (<b>«&nbsp;Conditions
d'utilisation&nbsp;»</b> ou <b>«&nbsp;Modalit&eacute;s&nbsp;»</b>)
r&eacute;gissent la relation entre vous et Nival, Inc. (<b>«&nbsp;Nival&nbsp;»</b>) concernant votre
utilisation des jeux sociaux en ligne et des services li&eacute;s
exploit&eacute;s par Nival (<b>«&nbsp;Service(s)&nbsp;»</b>).
Les pr&eacute;sentes Conditions d'utilisation int&egrave;grent et incorporent
d'autres politiques et r&egrave;gles importantes comprenant, sans s'y limiter,
notre <a href="http://fr.playpw.com/privacypolicy">Politique de
confidentialit&eacute;</a> et notre <a href="#Code de conduite">Code de conduite</a>
(mentionn&eacute;s ci-apr&egrave;s).</p>

<p>Si
vous utilisez nos Services via un r&eacute;seau social, une plateforme ou les
applications d'un fournisseur («&nbsp;Service tiers&nbsp;») (Facebook, Steam,
iTunes, Google Play, etc.), toute activit&eacute; fournie par cette tierce
partie en plus des Services de Nival est r&eacute;gie par les politiques
desdits Services tiers.</p>

<p>Si
vous refusez tout ou partie de la version actuelle des pr&eacute;sentes Conditions
d'utilisation, de la Politique de confidentialit&eacute; de Nival ou de toute
autre politique, r&egrave;gle de Nival ou de notre Code de conduite li&eacute;s
&agrave; votre utilisation des Services, vous devez cesser d'utiliser les
Services et votre licence d'exploitation des Services prendra fin.</p>

<p>Le
Groupe Nival d&eacute;tient et exploite les jeux et les services de jeu dans de
nombreuses juridictions. <b>Les pr&eacute;sentes
Conditions d'utilisation s'appliquent uniquement aux Services fournis par
Nival, Inc., situ&eacute;e aux &Eacute;tats-Unis.</b></p>

<h2>2. VIE PRIV&Eacute;E</h2>

<p>Nival
respecte la vie priv&eacute;e de ses utilisateurs. Notre Politique de
confidentialit&eacute; est incorpor&eacute;e et fait partie int&eacute;grante
des pr&eacute;sentes Conditions d'utilisation. En acc&eacute;dant aux Services,
vous reconnaissez que vous avez attentivement lu notre Politique de
confidentialit&eacute;, disponible &agrave; l'adresse suivante&nbsp;: <a href="http://fr.playpw.com/privacypolicy">http://fr.playpw.com/privacypolicy</a>. </p>

<h2>3. MISES &Agrave; JOUR</h2>

<p>Nival
se r&eacute;serve le droit, &agrave; son enti&egrave;re discr&eacute;tion, de
changer, modifier, ajouter ou supprimer des parties des pr&eacute;sentes
Conditions d'utilisation et de sa Politique de confidentialit&eacute; &agrave;
tout moment en publiant les Modalit&eacute;s modifi&eacute;es dans les Services
de Nival. Dans le cadre de ces modifications, vous pouvez &eacute;galement
recevoir des notifications suppl&eacute;mentaires, comme un e-mail ou une
notification apparaissant dans les Services. En continuant &agrave;
acc&eacute;der aux Services, vous acceptez lesdites modifications. Sauf mention
contraire, toutes les conditions modifi&eacute;es prennent effet 30&nbsp;jours
apr&egrave;s leur publication initiale. Nival se r&eacute;serve le droit de
r&eacute;viser d'autres politiques, codes ou r&egrave;gles &agrave; tout
moment. Toutes les nouvelles versions seront disponibles sur www.nival.com ou
via le jeu applicable. </p>

<h2>4. LICENCE D'EXPLOITATION DES SERVICES ET DES JEUX</h2>

<p>Dans
le cadre de la conformit&eacute; aux pr&eacute;sentes, Nival vous accorde une
licence limit&eacute;e non exclusive, non transf&eacute;rable et
r&eacute;vocable pour acc&eacute;der aux Services pour votre usage personnel et
non commercial uniquement. Vous vous engagez &agrave; ne pas utiliser les
Services &agrave; d'autres fins. Si vous violez l'une des pr&eacute;sentes
Modalit&eacute;s, nous nous r&eacute;servons le droit de mettre fin &agrave;
votre licence sans pr&eacute;avis.</p>

<h2>5. ACC&Egrave;S AUX SERVICES</h2>

<p>Si
vous utilisez ou avez obtenu l'acc&egrave;s aux Services via un Service tiers,
vous devez avoir un compte en r&egrave;gle pour ce Service tiers. Il peut
&eacute;galement vous &ecirc;tre demand&eacute; d'avoir un compte aupr&egrave;s
du fournisseur d'applications pour votre appareil mobile. Vous garantissez que
vous &ecirc;tes autoris&eacute; &agrave; recevoir des produits d'origine
am&eacute;ricaine, y compris des services ou des logiciels. Les frais
li&eacute;s &agrave; l'acc&egrave;s aux Services vous incombent, y compris les
frais de connexion Internet ou mobiles.</p>

<p>Veuillez
noter que (i) toute activit&eacute; sur un Service tiers au-del&agrave; de
l'&eacute;tendue des Services est r&eacute;gie par les politiques dudit Service
tiers. Par exemple, votre violation de la D&eacute;claration des droits et des
responsabilit&eacute;s de Facebook ou de l'Accord d'abonnement &agrave; Steam
peut entra&icirc;ner la r&eacute;vocation de votre utilisation des Services
Nival.</p>

<h2>6.MINEURS&nbsp;; CONSENTEMENT DES PARENTS/DU TUTEUR L&Eacute;GAL</h2>

<p>Vous
n'&ecirc;tes pas autoris&eacute; &agrave; utiliser nos Services si vous avez
moins de 13&nbsp;ans. En acc&eacute;dant &agrave; nos Services et en les
utilisant, vous d&eacute;clarez et garantissez que vous avez au moins 13 ans.
Si vous &ecirc;tes mineur et que vous avez moins de 13&nbsp;ans, vous devez
obtenir le consentement d'un parent ou d'un tuteur l&eacute;gal avant
d'utiliser les Services. Si vous achetez de l'Argent et/ou des Biens virtuels
(d&eacute;finis ci-apr&egrave;s dans la <a href="#section10">Section 10</a>) via
des cr&eacute;dits Facebook ou d'autres moyens autoris&eacute;s, vous devez
avoir plus de 18&nbsp;ans. Si vous avez moins de 18&nbsp;ans, vous garantissez
que vous avez la permission d'un parent/tuteur l&eacute;gal et consentez
&agrave; assumer les frais.</p>

<h2 id="Code de conduite">7. CODE DE CONDUITE</h2>

<p>Votre
utilisation des Services est r&eacute;gie par certaines r&egrave;gles (le <b>«&nbsp;Code de conduite&nbsp;»</b>), maintenues
et appliqu&eacute;es par Nival. Il est de votre responsabilit&eacute; de
conna&icirc;tre, comprendre et respecter ce Code de conduite. Toute utilisation
des Services contraire au Code de conduite est strictement interdite et peut
entra&icirc;ner la r&eacute;vocation imm&eacute;diate de votre licence
limit&eacute;e pour utiliser les Services et votre responsabilit&eacute; pour
violation de la loi peut &ecirc;tre engag&eacute;e. </p>

<p>Les
contenus et les comportements qui suivent sont formellement interdits dans les
Services et votre compte sera r&eacute;sili&eacute; en cas de telles attitudes
ou activit&eacute;s non autoris&eacute;es. Nival se r&eacute;serve le droit
d'enqu&ecirc;ter et de prendre les mesures l&eacute;gales n&eacute;cessaires
&agrave; l'encontre de toute personne qui, &agrave; l'enti&egrave;re
discr&eacute;tion de Nival, viole cette disposition.</p>

<p><b>Contenus et comportements offensants ou ill&eacute;gaux</b></p>

<p><b><i><span style='font-style:italic'>Vous vous engagez &agrave; ne pas, quelles
que soient les circonstances, adopter de comportement ou publier des contenus
dans les Services qui&nbsp;:</span></i></b></p>

<ol start=1 type=1>
 <li>sont offensants et/ou incitent au racisme, au
     sectarisme, &agrave; la haine ou &agrave; la violence physique de toute
     nature contre tout groupe ou tout individu&nbsp;; </li>
 <li>harc&egrave;lent ou appellent au
     harc&egrave;lement d'une tierce personne&nbsp;; </li>
 <li>exploitent les individus de fa&ccedil;on
     sexuelle ou violente&nbsp;; </li>
 <li>contiennent de la nudit&eacute;, de la
     violence, des sujets offensants ou un lien vers un site
     r&eacute;serv&eacute; aux adultes&nbsp;; </li>
 <li>favorisent des informations fausses ou
     trompeuses ou encouragent des activit&eacute;s ill&eacute;gales ou des
     comportements abusifs, mena&ccedil;ants, obsc&egrave;nes ou diffamatoires.
     </li>
</ol>

<p><b>Collecte et publication des Informations personnelles&nbsp;;
Utilisation des Services/communications abusives</b></p>

<p><b><i><span style='font-style:italic'>Vous vous engagez &agrave; ne pas, quelles
que soient les circonstances&nbsp;:</span></i></b></p>

<ol start=6 type=1>
 <li>collecter, r&eacute;colter ou publier les
     informations priv&eacute;es de tout individu, y compris des informations
     permettant une identification personnelle (qu'elles soient sous forme de
     texte, d'image ou de vid&eacute;o), des documents d'identification ou des
     informations financi&egrave;res via les Services&nbsp;; </li>
 <li>t&eacute;l&eacute;charger ou transmettre (ou
     tenter de t&eacute;l&eacute;charger ou de transmettre) tout
     mat&eacute;riel agissant comme collecteur d'informations passif ou actif
     ou tout m&eacute;canisme de transmission (balises Web, pixels invisibles,
     cookies ou autres appareils ou logiciels espions similaires)&nbsp;; </li>
 <li>utiliser abusivement les services de support de
     Nival ou soumettre de faux rapports d'abus ou de mauvaise conduite. </li>
</ol>

<p><b>Violations des lois et des politiques</b></p>

<p><b><i><span style='font-style:italic'>Vous vous engagez &agrave; ne pas, quelles
que soient les circonstances&nbsp;:</span></i></b></p>

<ol start=9 type=1>
 <li>violer la propri&eacute;t&eacute;
     contractuelle, personnelle, intellectuelle, ou tout autre droit de tout
     tiers&nbsp;; </span></font></li>
 <li>prendre part &agrave; la transmission de
     «&nbsp;pourriels&nbsp;», de cha&icirc;nes d'e-mail ou de mailing de masse
     non sollicit&eacute;, de messages instantan&eacute;s, de spimming ou de
     spamming&nbsp;; </li>
 <li>favoriser davantage l'activit&eacute; criminelle,
     entreprendre ou fournir des instructions relatives &agrave; des
     activit&eacute;s ill&eacute;gales incluant, sans s'y limiter, la
     fabrication ou l'achat ill&eacute;gal d'armes, la violation de la vie
     priv&eacute;e, la fourniture ou la cr&eacute;ation de virus
     informatiques&nbsp;; </li>
 <li>diffuser ou promouvoir la copie ill&eacute;gale
     ou interdite de mat&eacute;riel prot&eacute;g&eacute; par le droit
     d'auteur d'un autre individu, comme la fourniture de programmes
     pirat&eacute;s ou de liens vers ces programmes, la fourniture de
     renseignements qui permettent de contourner les dispositifs d'origine
     destin&eacute;s &agrave; prot&eacute;ger contre la copie ou la fourniture
     de jeux pirat&eacute;s ou de liens vers tout autre fichier
     ill&eacute;gal&nbsp;; </li>
 <li>diffuser, transmettre ou permettre le
     t&eacute;l&eacute;chargement de virus, de chevaux de Troie,
     d'enregistreurs de frappes, de bombes &agrave; retardement, de logiciels
     espions, de logiciels publicitaires ou de tout autre code ou programme
     malveillant ou intrusif&nbsp;; </li>
 <li>d&eacute;sosser, d&eacute;compiler, assembler
     en ordre inverse, modifier ou tenter de d&eacute;couvrir tout logiciel
     (code source ou code objet) cr&eacute;&eacute; par Nival pour
     g&eacute;n&eacute;rer des pages Web ou tout logiciel ou autre produit ou
     processus accessible via les Services&nbsp;; </li>
 <li>utiliser ou charger des scripts ou autres
     logiciels, espions, robots (ou «&nbsp;bots&nbsp;»), applications de
     triche, lecteurs hors-ligne ou autres syst&egrave;mes interdits pour
     acc&eacute;der aux Services (la technologie de moteur de recherche
     standard est interdite)&nbsp;; </li>
 <li>&eacute;viter ou interf&eacute;rer avec toute
     fonctionnalit&eacute; du Service li&eacute;e &agrave; la
     s&eacute;curit&eacute; ou toute fonctionnalit&eacute; restreignant ou
     assurant des limitations d'utilisation des Services ou des contenus
     (d&eacute;finies dans la <a href="#section9">Section 9</a> ci-apr&egrave;s)&nbsp;; </li>
 <li>participer &agrave; des actions qui, &agrave;
     la seule et enti&egrave;re discr&eacute;tion de Nival, escroquent ou sont
     susceptibles d'escroquer tout utilisateur des Services ayant gagn&eacute;
     de l'Argent ou des Biens virtuels en jouant dans les Services de
     mani&egrave;re l&eacute;gale&nbsp;; </li>
 <li>vendre tout ou partie des Services, y compris
     sans s'y limiter, l'Argent ou les Biens virtuels, les comptes utilisateurs
     et y acc&eacute;der en &eacute;change d'argent r&eacute;el ou d'objets
     ayant une valeur mon&eacute;taire&nbsp;; </li>
 <li>tricher ou prendre part &agrave; toute autre
     activit&eacute; jug&eacute;e contraire &agrave; l'esprit ou &agrave;
     l'intention des Services par Nival&nbsp;; </li>
 <li>entreprendre toute activit&eacute; commerciale
     et/ou vente interdite sans notre consentement &eacute;crit
     pr&eacute;alable. Cela inclut des concours, des tirages, de la
     publicit&eacute; et des op&eacute;rations pyramidales. </li>
</ol>

<p><b><i><span style='font-style:italic'>Les
activit&eacute;s interdites incluent dans tous les cas, sans s'y limiter,
l'utilisation des Services Nival d'une mani&egrave;re non conforme &agrave;
toute partie des lois et r&eacute;glementations applicables.</i></b></p>

<h2>8. PROPRI&Eacute;T&Eacute; DES SERVICES</h2>

<p>Nival
d&eacute;tient, poss&egrave;de des droits de licence ou d&eacute;tient les
droits pour utiliser tous les contenus pr&eacute;sents dans les Services. Nival
se r&eacute;serve tous les droits, en son nom et au nom de ses affili&eacute;s,
filiales ou conc&eacute;dants y compris, sans s'y limiter, tous les droits de
propri&eacute;t&eacute; intellectuelle ou autres droits propri&eacute;taires en
lien avec les Services. Vous reconnaissez que vous n'avez aucun droit ou titre
au regard de tout contenu pr&eacute;sent dans les Services, y compris, sans s'y
limiter, les contextes, textes, graphiques, logos, boutons, ic&ocirc;nes,
images, musiques, fichiers num&eacute;riques, donn&eacute;es et logiciels
fournis via les Services.</p>

<h2 id = "section9" >9. DROITS SUR LE CONTENU</h2>

<p>Le <b>«&nbsp;Contenu&nbsp;»</b> inclut les
logiciels, technologies, textes, publications sur les forums, publications sur
les chats, profils de personnages, messages, liens, e-mails, musiques, sons,
graphiques, images, vid&eacute;os, codes et tout autre mat&eacute;riel
audiovisuel ou autre apparaissant dans, &eacute;manant des Services ou leur
&eacute;tant destin&eacute;s (y compris la conception et l'apparence des
Services). Sauf mention &eacute;crite contraire, l'int&eacute;gralit&eacute; du
Contenu appartient &agrave; Nival ou &agrave; ses affili&eacute;s, filiales,
conc&eacute;dants ou fournisseurs. La d&eacute;finition collective du Contenu
inclut les Contenus g&eacute;n&eacute;r&eacute;s par les utilisateurs (<b>«&nbsp;CGU&nbsp;»</b>) et le Contenu de Nival.</p>

<p>Vous
reconnaissez que l'ensemble du Contenu, y compris mais sans s'y limiter tous
les comptes, personnages cr&eacute;&eacute;s, Argent virtuel et Biens virtuels
acquis et d&eacute;velopp&eacute;s au cours de votre utilisation des Services
sont la propri&eacute;t&eacute; exclusive de Nival ou de ses conc&eacute;dants.
Nival peut utiliser l'int&eacute;gralit&eacute; du Contenu &agrave; toute fin,
y compris &agrave; des fins commerciales ou promotionnelles, sans restriction
ni r&eacute;mun&eacute;ration pour vous. Vous vous engagez &agrave; ne pas
copier, redistribuer, publier ou autrement exploiter tout Contenu enfreignant
les droits de propri&eacute;t&eacute; intellectuelle de Nival ou de toute autre
tierce partie.</p>

<p><b>CGU</b><br>
Dans tous les cas, vous acceptez que ces CGU proviennent exclusivement de vous
et vous d&eacute;tenez exclusivement les droits de ces CGU, y compris le droit
d'accorder tous les droits et licences de tels CGU &agrave; Nival sans que
Nival n'applique d'obligations de tierces parties ou de responsabilit&eacute;s
d&eacute;coulant de son application des droits que vous lui accordez par la
pr&eacute;sente. </p>

<p>Vous
accordez &agrave; Nival une licence non exclusive, internationale, libre de
droits, incessible et transf&eacute;rable pour (i) utiliser, reproduire,
distribuer, pr&eacute;parer des &eacute;l&eacute;ments d&eacute;riv&eacute;s
des, diffuser, ex&eacute;cuter et autrement exploiter de quelque fa&ccedil;on
que ce soit tout ou partie des CGU dans les Services et dans tous les
m&eacute;dias connus actuellement et con&ccedil;us &agrave; l'avenir, et (ii)
r&eacute;aliser des actions publicitaires, promotionnelles et de
commercialisation des &eacute;l&eacute;ments cit&eacute;s. Dans la mesure
permise par la loi applicable, vous transf&eacute;rez et/ou renoncez &agrave;
tout droit moral ou droit de publicit&eacute; ou de confidentialit&eacute; que
vous pouvez d&eacute;tenir relativement aux CGU. Vous supportez les risques
li&eacute;s &agrave; l'exhaustivit&eacute;, la pr&eacute;cision et/ou la
qualit&eacute; de vos CGU pr&eacute;sents dans les Jeux. Si les Services
auxquels vous apportez des CGU permettent &agrave; d'autres utilisateurs
d'acc&eacute;der &agrave; ces CGU et de les utiliser comme partie des Services,
vous accordez &agrave; tous les autres utilisateurs des Services applicables le
droit d'utiliser, copier, modifier, diffuser, ex&eacute;cuter, cr&eacute;er des
&eacute;l&eacute;ments d&eacute;riv&eacute;s de et autrement communiquer et
distribuer vos CGU dans ou via les Services applicables sans notification,
attribution ou r&eacute;mun&eacute;ration pour vous. </p>

<p>Nival
se r&eacute;serve le droit de contr&ocirc;ler les CGU dans les Jeux mais ne
peut ni surveiller ni pr&eacute;visualiser l'int&eacute;gralit&eacute; des CGU
et ne tente pas de le faire. Nival a le droit, mais pas l'obligation,
d'&eacute;diter, de refuser de publier ou de supprimer tout CGU publi&eacute;
dans les Jeux jug&eacute; inadmissible ou violant les pr&eacute;sentes
Modalit&eacute;s ou leur esprit, &agrave; notre seule et enti&egrave;re
discr&eacute;tion et d&eacute;cision.</p>

<p>Si
un utilisateur pense qu'un CGU donn&eacute; est susceptible de violer les
pr&eacute;sentes Conditions d'utilisation, veuillez nous contacter. Nival
d&eacute;cline toute responsabilit&eacute; quant aux CGU
g&eacute;n&eacute;r&eacute;s par les utilisateurs des Jeux.</p>

<p><b>Contenus tiers</b><br>
Dans les Services, vous ne pouvez ni t&eacute;l&eacute;charger ni publier de
Contenus violant les droits d'auteur, la marque commerciale ou d'autres droits
de propri&eacute;t&eacute; intellectuelle d'une tierce partie. Vous ne pouvez
pas t&eacute;l&eacute;charger de Contenus portant atteinte &agrave; la vie
priv&eacute;e ou violant les droits &agrave; la publicit&eacute; de toute
tierce partie. Nival peut, sans pr&eacute;avis et &agrave; son enti&egrave;re
discr&eacute;tion, supprimer des Contenus susceptibles de violer les droits de
propri&eacute;t&eacute; intellectuelle ou tout autre droit d'une tierce partie.
</p>

<p>En
cas de violations r&eacute;p&eacute;t&eacute;es de votre part des droits de
propri&eacute;t&eacute; intellectuelle ou d'autres droits de Nival ou de toute
tierce partie, Nival peut r&eacute;silier votre compte sans vous avertir. En
cas de r&eacute;siliation de votre compte, vous ne pouvez pas vous faire
rembourser les frais pay&eacute;s et vous perdrez l'acc&egrave;s &agrave;
l'Argent virtuel, aux Biens virtuels et aux autres avantages de votre compte.</p>

<h2 id="section10">10.ARGENT VIRTUEL ET BIENS VIRTUELS</h2>

<p>Les
Services peuvent inclure de l'argent virtuel pr&eacute;sent dans le jeu (<b>«&nbsp;Argent virtuel&nbsp;»</b>), comme des
pi&egrave;ces, du cash ou des points, qui peuvent &ecirc;tre achet&eacute;s
avec de l'argent r&eacute;el via des transactions avec l'un de nos fournisseurs
de solutions de paiement autoris&eacute;s. L'Argent virtuel peut &ecirc;tre
utilis&eacute; pour acheter des &eacute;l&eacute;ments virtuels,
num&eacute;riques ou d'autres services dans le jeu (<b>«&nbsp;Biens virtuels&nbsp;»</b>). Nival ne g&egrave;re pas
directement les transactions relatives &agrave; l'Argent virtuel Les
fournisseurs de paiement tiers g&egrave;rent toutes les transactions d'Argent
virtuel. En achetant de l'Argent virtuel &agrave; utiliser dans les Services,
vous &ecirc;tes li&eacute; aux Conditions d'utilisations de ces fournisseurs de
paiement tiers.</p>

<p>Nival
interdit et ne reconna&icirc;t pas les transferts pr&eacute;tendus de
propri&eacute;t&eacute;s virtuelles effectu&eacute;s en dehors du Service ou la
vente, le don ou le commerce pr&eacute;tendus dans le «&nbsp;monde
r&eacute;el&nbsp;» de tout &eacute;l&eacute;ment apparaissant dans ou provenant
du Service, sauf autorisation expresse &eacute;crite par Nival. Vous ne pouvez
pas commercialiser, vendre ou tenter de vendre de l'argent ou des
&eacute;l&eacute;ments du jeu pour de l'argent r&eacute;el ou &eacute;changer
ces &eacute;l&eacute;ments ou cet argent contre des objets de valeur en dehors
du jeu sans la permission &eacute;crite de Nival. Tout transfert ou tentative
de transfert de ce type est proscrit et nul et entra&icirc;nera la
cl&ocirc;ture de votre compte.</p>

<p><b>Paiement de l'Argent virtuel et des Biens virtuels.</b> Votre
commande d'Argent et/ou de Biens virtuels repr&eacute;sentera une offre
&agrave; Nival pour l'achat de tels &eacute;l&eacute;ments, que nous
accepterons une fois l'Argent/les Biens virtuels applicables rendus disponibles
dans votre compte pour votre utilisation dans les Services ou une fois votre
carte de cr&eacute;dit d&eacute;bit&eacute;e, selon la premi&egrave;re de ces
occurrences. Nival peut r&eacute;viser la tarification de l'Argent virtuel et
des Biens virtuels propos&eacute;s dans les Services &agrave; tout moment.</p>

<p>Notez
que si vous achetez des cr&eacute;dits Facebook, des cr&eacute;dits Google Play
ou d'autres cr&eacute;dits de paiement propos&eacute;s par les Services tiers
applicables, vous acceptez les conditions de paiement dudit Service tiers et
Nival ne participe pas &agrave; la transaction. Vous vous engagez &agrave;
payer tous les frais et taxes applicables qui vous incombent ou qui incombent
&agrave; toute personne utilisant un compte enregistr&eacute; &agrave; votre nom.</p>

<p>Toutes
les ventes d'Argent et de Biens virtuels sont finales. VOUS RECONNAISSEZ QUE
NIVAL N'EST PAS TENU DE PROC&Eacute;DER &Agrave; UN REMBOURSEMENT, POUR QUELQUE
RAISON QUE CE SOIT, ET QUE VOUS NE RECEVREZ NI ARGENT NI AUTRE COMPENSATION EN
CAS DE NON-UTILISATION DE L'ARGENT OU DES BIENS VIRTUELS LORS DE LA
CL&Ocirc;TURE D'UN COMPTE, QUE CELLE-CI SOIT VOLONTAIRE OU NON. </p>

<p>En
d&eacute;pit de ce qui pr&eacute;c&egrave;de, si des frais ou des taxes sont
factur&eacute;s &agrave; un utilisateur dans le cadre d'un vol
d'identit&eacute; justifi&eacute;, Nival collaborera avec l'utilisateur et le
fournisseur tiers de paiement pour obtenir le remboursement desdits frais ou
taxes. </p>

<p>De
plus, si vous r&eacute;sidez en UE, vous pouvez disposer du droit d'annuler un
achat dans un d&eacute;lai de sept jours calendaires &agrave; compter de la
date de r&eacute;ception de l'achat («&nbsp;p&eacute;riode de
r&eacute;flexion&nbsp;»). Cela s'applique uniquement si vous n'avez pas
utilis&eacute; votre Argent et/ou vos Biens virtuels. Par exemple, si vous
achetez un Bien virtuel qui vous est fourni et que vous l'utilisez imm&eacute;diatement
dans les Services, vous perdez votre droit de retrait. Si vous n'avez pas
utilis&eacute; l'Argent et/ou les Biens virtuels dans la p&eacute;riode de
r&eacute;flexion et que vous souhaitez &ecirc;tre rembours&eacute;, avertissez
imm&eacute;diatement Nival pour que le remboursement ait lieu dans un
d&eacute;lai de 30 jours.</p>

<p>Si
votre utilisation des Services est soumise &agrave; des taxes d'utilisation ou
de vente de tout type, Nival peut vous facturer lesdites taxes. </p>

<p>En
dehors d'une licence limit&eacute;e, r&eacute;vocable et non
transf&eacute;rable pour utiliser l'Argent ou les Biens virtuels dans les Services,
vous ne disposez d'aucun droit ni d'aucun titre au regard de cet Argent/de ces
Biens virtuels. Nival est en droit de g&eacute;rer, r&eacute;guler,
contr&ocirc;ler, modifier et/ou &eacute;liminer l'Argent et/ou les Biens
virtuels &agrave; son enti&egrave;re discr&eacute;tion et ne peut &ecirc;tre
tenu responsable &agrave; votre &eacute;gard ou &agrave; l'&eacute;gard de
toute autre personne pour l'application d'un tel droit. </p>

<h2>11. LIENS VERS DES SITES TIERS&nbsp;; PUBLICIT&Eacute;S</h2>

<p>Dans
les Services, Nival peut fournir des liens vers des sites Web de tierces
parties ou vers des fournisseurs qui peuvent vous inviter &agrave; participer
&agrave; une offre promotionnelle en &eacute;change Services, d'Argent virtuel
ou de Biens virtuels suppl&eacute;mentaires. Tout frais ou toute obligation que
vous encourez lors de vos interactions avec des tierces parties vous incombent.
Nival ne fait aucune d&eacute;claration et n'offre aucune garantie quant aux
contenus, aux biens et/ou aux services fournis par une tierce partie
(m&ecirc;me si nos Services pointent vers ladite tierce partie) et ne peut
&ecirc;tre tenu responsable de toute plainte li&eacute;e aux contenus, aux
biens et/ou aux services de tierces parties. Nival n'est pas responsable des
contenus, des pratiques commerciales ou des politiques de
confidentialit&eacute; de ces tierces parties, ni de la collecte, l'utilisation
ou la divulgation de toute information collect&eacute;e par ces sites. </p>

<h2>12. PROPRI&Eacute;T&Eacute; INTELLECTUELLE</h2>

<p><b>Marques commerciales.</b> Nival et les autres marques commerciales,
graphiques, logos et marques de service relatifs utilis&eacute;s sur le site
sont des marques commerciales de Nival et de ses conc&eacute;dants et vous ne
pouvez les utiliser sans notre accord &eacute;crit pr&eacute;alable.</p>

<p><b>Droits d'auteur.</b> Tout Contenu est prot&eacute;g&eacute; par les lois
de droit d'auteur des &Eacute;tats-Unis et/ou des lois similaires d'autres
juridictions le prot&eacute;geant des utilisations non autoris&eacute;es. </p>

<p><b>Violation des droits d'auteur</b> Si vous d&eacute;tenez des droits d'auteur ou en
&ecirc;tes mandataire et que vous pensez que des &eacute;l&eacute;ments
prot&eacute;g&eacute;s par ce droit ont &eacute;t&eacute; copi&eacute;s et
publi&eacute;s dans les Services, constituant une violation de droits d'auteur,
envoyez une notification en application du Digital Millenium Copyright Act
(DMCA) en fournissant &agrave; votre responsable DCMA les informations suivantes
par &eacute;crit (voir 17 U.S.C. 512(c)(3) pour plus de d&eacute;tails)&nbsp;:</p>

<ol start=1 type=1>
  <li>des d&eacute;tails raisonnablement suffisants
      pour nous permettre d'identifier les &eacute;l&eacute;ments
      concern&eacute;s par la violation ou, en cas de multiples
      &eacute;l&eacute;ments concern&eacute;s, une liste repr&eacute;sentative
      de ces &eacute;l&eacute;ments (par exemple&nbsp;: titre, auteur,
      num&eacute;ro d'enregistrement ou de suivi, URL)&nbsp;; </li>
  <li>des d&eacute;tails raisonnablement suffisants
      pour nous permettre d'identifier et de localiser les
      &eacute;l&eacute;ments concern&eacute;s par la violation (par exemple un
      lien vers la page qui contient les &eacute;l&eacute;ments)&nbsp;; </li>
  <li >vos informations de contact pour que nous
      puissions communiquer avec vous (par exemple votre adresse, votre
      num&eacute;ro de t&eacute;l&eacute;phone, votre e-mail)&nbsp;; </li>
  <li>une d&eacute;claration stipulant que vous
      pensez en toute bonne foi que l'utilisation des &eacute;l&eacute;ments
      identifi&eacute;s dans la sous-section ii ci-dessus n'est pas
      autoris&eacute;e par le propri&eacute;taire des droits d'auteur, leur
      mandataire ou la loi&nbsp;;</li>
  <li>une attestation qui, sous peine de parjure,
      d&eacute;clare que les informations contenues dans la notification sont
      exactes et que vous &ecirc;tes en droit d'agir au nom du
      propri&eacute;taire du droit exclusif ayant &eacute;t&eacute;
      enfreint&nbsp;; </li>
  <li>votre signature physique ou
      &eacute;lectronique. </li>
</ol>

<p>Veuillez
envoyer cette notification &eacute;crite &agrave; votre responsable
d&eacute;sign&eacute; comme suit&nbsp;:</p>

<p><b>Responsable DCMA&nbsp;:</b></p>

<p><b>NIVAL</b><br>
2601 Ocean Park Blvd., Suite 205<br>
Santa Monica, CA 90405<br>
Attention&nbsp;: General Counsel (Directeur juridique)<br>
<a href="mailto:legal@nival.com">legal@nival.com </a></p>

<p>Pour
plus d'informations sur la loi relative aux droits d'auteur et aux
notifications DCMA, veuillez consulter votre avocat afin de comprendre
pleinement vos droits et obligations au regard de la section 512(c) de la Loi
sur le droit d'auteur («&nbsp;Copyright Act&nbsp;») et d'autres lois.</p>

<p><span style='color:red;'><b>Contrefa&ccedil;on de marque</b>. Si vous &ecirc;tes propri&eacute;taire ou agent d'une marque et pensez que votre marque ou toute autre propri&eacute;t&eacute; intellectuelle a
&eacute;t&eacute; copi&eacute;e et publi&eacute;e dans les Services d'une
mani&egrave;re constituant une atteinte, informez-en notre responsable DCMA
&agrave; l'adresse ci-dessus. Indiquez par &eacute;crit les informations
suivantes&nbsp;:</span></p>

<ol start=1 type=1 style="color:red">
  <li>votre nom, adresse et autres informations de contact ;</li>
  <li>votre nom d'utilisateur ;</li>
  <li >votre marque (y compris son numéro et son pays d'immatriculation) ;</li>
  <li>une description de votre requête.</li>
</ol>

<h2>13. LITIGES ENTRE LES MEMBRES&nbsp;; D&Eacute;CHARGE</h2>

<p>Vous
&ecirc;tes enti&egrave;rement responsable de vos interactions avec d'autres
utilisateurs des Services et toute autre partie avec qui vous interagissez via
les Services et/ou les Jeux Nival. Nival se r&eacute;serve le droit mais n'est
en rien tenu de s'impliquer de quelque mani&egrave;re que ce soit dans ces
litiges. En cas litige avec un ou plusieurs utilisateurs, vous d&eacute;chargez
Nival (et ses employ&eacute;s, directeurs, agents, filiales et associ&eacute;s)
des plaintes, demandes ou dommages (directs ou indirects) de toute sorte et de
toute nature, connus ou inconnus, d&eacute;coulant de ou li&eacute;s de quelque
mani&egrave;re que ce soit &agrave; de tels litiges. </p>

<h2>14. MISES &Agrave; JOUR DES SERVICES</h2>

<p>Vous
reconnaissez que le Service est &eacute;volutif. Nival peut n&eacute;cessiter
que vous acceptiez les mises &agrave; jour des Services. Vous reconnaissez et
acceptez que Nival puise mettre les Services &agrave; jour avec ou sans
pr&eacute;avis. Il peut &ecirc;tre n&eacute;cessaire de mettre &agrave; jour
les logiciels de temps &agrave; autre pour recevoir les Services.</p>

<h2>15. LIMITATION DE GARANTIES</h2>

<p>LES
SERVICES SONT FOURNIS «&nbsp;EN L'&Eacute;TAT&nbsp;» ET SELON LEUR
DISPONIBILIT&Eacute;. NIVAL NE FAIT AUCUNE D&Eacute;CLARATION ET N'OFFRE AUCUNE
GARANTIE DE QUELQUE SORTE QU'ELLE SOIT, EXPRESSE OU TACITE, QUANT AU
FONCTIONNEMENT DES SERVICES OU AUX INFORMATIONS, CONTENUS, MAT&Eacute;RIAUX OU
PRODUITS INCLUS DANS LES SERVICES OU FOURNIS VIA NIVAL. VOUS RECONNAISSEZ
EXPRESS&Eacute;MENT QUE VOUS UTILISEZ LES SERVICES &Agrave; VOS SEULS RISQUES
ET VOUS SEREZ ENTI&Egrave;REMENT RESPONSABLE DE TOUT DOMMAGE &Agrave; VOTRE
SYST&Egrave;ME INFORMATIQUE OU DE TOUTE PERTE DE DONN&Eacute;ES
D&Eacute;COULANT DE VOTRE UTILISATION DES SERVICES.</p>

<p>DANS
LA MESURE PERMISE PAR LA LOI, NIVAL D&Eacute;CLINE TOUTE RESPONSABILIT&Eacute;,
EXPRESSE OU TACITE, Y COMPRIS MAIS SANS S'Y LIMITER, LES GARANTIES TACITES DE
QUALIT&Eacute; MARCHANDE ET DE CONVENANCE &Agrave; UNE FIN PARTICULI&Egrave;RE.
SANS LIMITER CE QUI PR&Eacute;C&Egrave;DE, NIVAL, SES AFFILI&Eacute;S, FILIALES
OU LEURS DIRECTEURS, EMPLOY&Eacute;S, AGENTS, AVOCATS, FOURNISSEURS DE CONTENUS
TIERS, DISTRIBUTEURS, CONC&Eacute;DANTS OU LICENCI&Eacute;S NE GARANTISSENT PAS
QUE LES SERVICES SERONT ININTERROMPUS OU EXEMPTS D'ERREURS.</p>

<h2 id="section16">16. LIMITATIONS&nbsp;; EXCLUSIONS DE RESPONSABILIT&Eacute;S</h2>

<p>NIVAL
NE PEUT &Ecirc;TRE TENU RESPONSABLE DES DOMMAGES DE QUELQUE SORTE QU'ILS SOIENT
D&Eacute;COULANT DE L'UTILISATION DES SERVICES, Y COMPRIS MAIS SANS S'Y
LIMITER, LES DOMMAGES DIRECTS, INDIRECTS, ACCESSOIRES, PUNITIFS ET
CONS&Eacute;CUTIFS, Y COMPRIS LES PERTES DE PROFITS, DE CLIENT&Egrave;LE OU
TOUTE AUTRE PERTE INTANGIBLE, M&Ecirc;ME SI NIVAL A &Eacute;T&Eacute;
INFORM&Eacute; DE LA POSSIBILIT&Eacute; DE TELS DOMMAGES.</p>

<p>SI
VOUS N'&Ecirc;TES PAS SATISFAIT DES SERVICES, VOTRE SEUL ET UNIQUE RECOURS EST
DE CESSER DE LES UTILISER. LE PLAFOND DE GARANTIE MAXIMUM DE NIVAL ENVERS VOUS
POUR TOUTES LES PLAINTES D&Eacute;COULANT DE OU LI&Eacute;ES AUX SERVICES NE
PEUT EXC&Eacute;DER LA SOMME TOTALE QUE VOUS AVEZ VERS&Eacute;E &Agrave; NIVAL
DANS LES CENT QUATRE-VINGT JOURS (180) JOURS PR&Eacute;C&Eacute;DANT LAPLAINTE.
LE NOMBRE DE PLAINTES N'AFFECTE PAS CETTE LIMITATION. </p>

<p>CERTAINES
LOIS N'AUTORISENT PAS LA LIMITATION DES GARANTIES IMPLICITES, L'EXCLUSION OU LA
LIMITATION DE CERTAINS DOMMAGES. SI CES LOIS S'APPLIQUENT &Agrave; VOUS, TOUT
OU PARTIE DES D&Eacute;CLARATIONS DE NON-RESPONSABILIT&Eacute;, D'EXCLUSION OU
DE LIMITATIONS PEUVENT NE PAS S'APPLIQUER &Agrave; VOUS ET VOUS POUVEZ DISPOSER
DE DROITS SUPPL&Eacute;MENTAIRES.</p>

<h2>17. INDEMNISATION</h2>

<p>Vous
vous engagez &agrave; indemniser et &agrave; d&eacute;gager de toute
responsabilit&eacute; Nival, ses soci&eacute;t&eacute;s affili&eacute;es,
contractants, employ&eacute;s, agents, fournisseurs tiers, conc&eacute;dants et
partenaires des plaintes, pertes, dommages, responsabilit&eacute;s, y compris
les honoraires et les frais juridiques, d&eacute;coulant de votre utilisation
correcte ou incorrecte des Services, de toute violation de votre part des
Conditions d'utilisation ou de toute violation des d&eacute;clarations,
garanties et engagements qui vous incombent par la pr&eacute;sente. Nival se
r&eacute;serve le droit d'assumer, &agrave; vos frais, la d&eacute;fense et le
contr&ocirc;le exclusifs de toute question pour laquelle vous devez indemniser
Nival, et vous acceptez de coop&eacute;rer avec la d&eacute;fense de Nival en
cas de telles plaintes. Nival d&eacute;ploiera des efforts raisonnables pour
vous informer d'une telle plainte, action ou proc&eacute;dure une fois que nous
en aurons connaissance.</p>

<p><b><i><span style='font-style:italic'>Vous reconnaissez
que les dispositions du pr&eacute;sent paragraphe demeurent en vigueur
apr&egrave;s la cl&ocirc;ture de votre compte ou des Services.</span></i></b></p>

<h2>18. R&Eacute;SOLUTION DES LITIGES</h2>

<p>Avant
d'entamer les proc&eacute;dures officielles de r&eacute;solution de litiges,
nous vous encourageons vivement &agrave; nous contacter directement via le
service d'assistance &agrave; la client&egrave;le pour chercher une solution et
tenter de r&eacute;soudre le litige dans un d&eacute;lai de trente (30) jours.
En cas d'&eacute;chec, des discussions informelles suppl&eacute;mentaires
commenceront apr&egrave;s notification &eacute;crite de votre part ou de la
part de Nival. Nival enverra sa notification &agrave; l'adresse e-mail que vous
nous avez fournie et peut &eacute;galement transmettre une copie &agrave; une
adresse physique, si nous en disposons. Vous enverrez votre notification
&agrave; Nival &agrave; l'adresse suivante&nbsp;: <a href="mailto:legal@nival.com">legal@nival.com</a>&nbsp;; avec une copie &eacute;crite &agrave;&nbsp;:
Nival, Attention&nbsp;: General Counsel (Directeur juridique), 1920 East
Hallandale Beach Blvd., PH-6, Hallandale Beach, FL 33009. La section 18
s'applique dans toute la mesure permise par la loi applicable. Si les lois de
votre juridiction interdisent l'application de tout ou partie des dispositions
de la pr&eacute;sente section, lesdites dispositions ne s'appliquent pas
&agrave; vous.</p>

<p><b>Exceptions aux discussions
informelles et &agrave; l'arbitrage.</b> Vous et Nival reconnaissez que les litiges suivants ne sont pas soumis aux
dispositions concernant les discussions informelles et l'arbitrage
ex&eacute;cutoire&nbsp;: (1) tout litige visant &agrave; faire appliquer ou
&agrave; prot&eacute;ger, ou concernant la validit&eacute; de tout droit de
propri&eacute;t&eacute; intellectuelle&nbsp;; (2) tout litige associ&eacute;
&agrave;, ou d&eacute;coulant d'all&eacute;gations de vol, de piratage,
d'atteinte &agrave; la vie priv&eacute;e ou d'activit&eacute;s
criminelles&nbsp;; et (3) tout recours en injonction.</p>

<p><b>Arbitrage</b></p>

<p><b>&Eacute;tats-Unis</b></p>

<p>Si
vous r&eacute;sidez aux &Eacute;tats-Unis et que vous ne parvenez pas &agrave;
r&eacute;soudre un litige via des discussions informelles, vous ou Nival pouvez
d&eacute;cider de r&eacute;soudre le litige (&agrave; l'exception des litiges
express&eacute;ment exclus ci-dessous) exclusivement et sans appel par un arbitrage
ex&eacute;cutoire et final. VOUS COMPRENEZ QU'EN L'ABSENCE DE LA
PR&Eacute;SENTE DISPOSITION VOUS AURIEZ LE DROIT DE POURSUIVRE EN JUSTICE ET
D'OBTENIR UN PROC&Egrave;S DEVANT JURY.</p>

<p>L'arbitrage
doit &ecirc;tre ex&eacute;cut&eacute; en vertu des r&egrave;gles d'arbitrage
commercial de l'American Arbitration Association («&nbsp;AAA&nbsp;»). Vos frais
d'arbitrage et votre part de l'indemnisation de l'arbitre sont r&eacute;gis par
ces r&egrave;gles de l'AAA. Si de tels frais sont jug&eacute;s excessifs par
l'arbitre, Nival paiera l'int&eacute;gralit&eacute; des honoraires et des frais
d'arbitrage. </p>

<p>L'arbitrage
peut &ecirc;tre r&eacute;alis&eacute; en pr&eacute;sence des parties, par la
soumission de documents, par t&eacute;l&eacute;phone ou en ligne, comme le
permettent les r&egrave;gles de l'AAA. Sauf mention contraire dans le
pr&eacute;sent Accord, vous et Nival pouvez porter votre litige devant un
tribunal pour contraindre &agrave; l'arbitrage, poursuivre la proc&eacute;dure
en attendant l'arbitrage ou confirmer, modifier, annuler ou prononcer un
jugement sur la d&eacute;cision arbitrale de l'arbitre.</p>

<p><b>Renonciation au recours collectif.</b> Vous et Nival acceptez que l'arbitrage se limite au
litige entre Nival et vous, individuellement. Dans toute la mesure permise par
la loi, aucun arbitrage ni aucune autre proc&eacute;dure de r&eacute;solution
des litiges ne pourra &ecirc;tre rejointe par une autre partie ou se
d&eacute;cider sur la base d'un recours collectif.</p>

<p><b>Limitation dans le temps pour les
r&eacute;clamations juridiques.</b> VOUS ET NIVAL ACCEPTEZ QUE TOUTE ACTION D&Eacute;COULANT DES OU EN RELATION
AVEC LES SERVICES NIVAL DOIT D&Eacute;BUTER DANS UN D&Eacute;LAI D'UN (1) AN
SUIVANT LE FAIT G&Eacute;N&Eacute;RATEUR DE LADITE ACTION. DANS LE CAS
CONTRAIRE, LADITE CAUSE D'ACTION SERA PROSCRITE DE FA&Ccedil;ON PERMANENTE.</p>

<p><b>Lieu.</b> Tout arbitrage se d&eacute;roulera dans le
comt&eacute; de Los Angeles, Californie, &Eacute;tats-Unis. Chaque partie peut
&ecirc;tre pr&eacute;sente via des moyens num&eacute;riques ou
t&eacute;l&eacute;phoniques si elle ne peut pas raisonnablement &ecirc;tre
pr&eacute;sente en personne. Tout litige non soumis &agrave; l'arbitrage ou
pour lequel il n'est pas d&eacute;cid&eacute; de faire recours &agrave; un
arbitrage sera r&eacute;solu par un tribunal de la juridiction
comp&eacute;tente dans le comt&eacute; de Los Angeles, Californie,
&Eacute;tats-Unis, et vous-m&ecirc;mes et Nival acceptez de vous soumettre
&agrave; la comp&eacute;tence personnelle de ce tribunal.
L'interpr&eacute;tation et l'ex&eacute;cution du pr&eacute;sent Accord, ainsi
que les relations l&eacute;gales entre les parties, sont r&eacute;gies par les
lois de l'&Eacute;tat de Californie sans &eacute;gard &agrave; ses dispositions
concernant les conflits de lois. Par la pr&eacute;sente, chaque partie
abandonne toute r&eacute;clamation dont la venue est inappropri&eacute;e.</p>

<p><b>Union europ&eacute;enne et Suisse </b></p>

<p>Si
vous r&eacute;sidez en dehors des &Eacute;tats-Unis et que vous utilisez les
Services fournis par Nival ou y acc&eacute;dez depuis l'Union europ&eacute;enne
ou la Suisse, les pr&eacute;sentes Conditions d'utilisation sont r&eacute;gies
par et interpr&eacute;t&eacute;es en vertu des lois du Grand-Duch&eacute; de
Luxembourg et doivent &ecirc;tre consid&eacute;r&eacute;es con&ccedil;ues et
accept&eacute;es dans le Grand-Duch&eacute; de Luxembourg, sans &eacute;gard
&agrave; ses dispositions concernant les conflits de lois. </p>

<p>Les
litiges exc&eacute;dant 5&nbsp;000&nbsp;€ en lien avec les Services doivent
&ecirc;tre r&eacute;gis par la juridiction exclusive des tribunaux
situ&eacute;s dans la ville de Luxembourg et vous acceptez de vous soumettre
&agrave; la juridiction personnelle desdits tribunaux pour le r&egrave;glement
de tels litiges ou de telles plaintes. </p>

<p>Les
litiges impliquant une plainte de 5&nbsp;000&nbsp;€ ou moins en lien avec les
Services que vous n'avez pas r&eacute;ussi &agrave; r&eacute;soudre via des
m&eacute;thodes de r&eacute;solution de litiges informelles doivent &ecirc;tre
exclusivement r&eacute;solus via un arbitrage ex&eacute;cutoire
g&eacute;r&eacute; par le Centre international pour le r&egrave;glement des
diff&eacute;rends devant un (1) arbitre, conform&eacute;ment &agrave; son
R&egrave;glement d'arbitrage international. Tout arbitrage se d&eacute;roulera
dans la ville de Luxembourg. Chaque partie peut &ecirc;tre pr&eacute;sente via
des moyens num&eacute;riques ou t&eacute;l&eacute;phoniques si elle ne peut pas
raisonnablement &ecirc;tre pr&eacute;sente en personne. </p>

<p>Par
la pr&eacute;sente, chaque partie abandonne toute r&eacute;clamation selon
laquelle la venue est inappropri&eacute;e. </p>

<p>Vous
et Nival acceptez que les r&egrave;gles suivantes s'appliquent aux
proc&eacute;dures d'arbitrage&nbsp;: (a) l'arbitrage doit &ecirc;tre
effectu&eacute; en anglais ou dans une langue mutuellement convenue entre les
parties&nbsp;; (b) l'arbitrage doit se d&eacute;rouler en temps utile&nbsp;;
(c) les instructions et les &eacute;changes d'informations avant l'audience
doivent se limiter &agrave; la production raisonnable de documents
pertinents&nbsp;; (d) la sentence arbitrale doit &ecirc;tre rendue dans les six
(6) mois suivant le d&eacute;but de l'arbitrage, sauf en cas de prolongation du
d&eacute;lai par l'arbitre&nbsp;; et (e) tout jugement relatif &agrave; la
sentence de l'arbitre peut &ecirc;tre inscrit aupr&egrave;s de tout tribunal
comp&eacute;tent. Si les frais sont jug&eacute;s excessifs par l'arbitre, Nival
paiera l'int&eacute;gralit&eacute; des honoraires et des frais d'arbitrage. </p>

<p><b>R&eacute;sidents de pays hors de
l'Union europ&eacute;enne, de la Suisse et des &Eacute;tats-Unis</b></p>

<p>Si
vous r&eacute;sidez dans un pays en dehors de l'Union europ&eacute;enne, de la
Suisse et/ou des &Eacute;tats-Unis, l'arbitrage doit &ecirc;tre engag&eacute;
dans le comt&eacute; de Los Angeles, Californie et vous acceptez de vous
soumettre &agrave; la juridiction personnelle des tribunaux de Los Angeles pour
contraindre &agrave; l'arbitrage, poursuivre la proc&eacute;dure en attendant
l'arbitrage, ou confirmer, modifier, annuler ou prononcer un jugement sur la
d&eacute;cision arbitrale de l'arbitre. Des modalit&eacute;s
suppl&eacute;mentaires sont indiqu&eacute;es pr&eacute;c&eacute;demment, dans
la section applicable &agrave; l'arbitrage aux &Eacute;tats-Unis.</p>

<h2>20. DISPOSITIONS G&Eacute;N&Eacute;RALES</h2>

<p><b>Affectation. Nival</b>
peut affecter ou d&eacute;l&eacute;guer les pr&eacute;sentes Conditions
d'utilisation et/ou sa Politique de confidentialit&eacute;, partiellement ou
int&eacute;gralement, &agrave; toute personne ou entit&eacute;, &agrave; tout
moment, avec ou sans votre consentement. Vous ne pouvez pas affecter ou
d&eacute;l&eacute;guer les droits ou obligations qui vous incombent en vertu
des pr&eacute;sentes Conditions d'utilisation ou de la Politique de
confidentialit&eacute; de Nival sans le consentement &eacute;crit
pr&eacute;alable de Nival et toute affectation et d&eacute;l&eacute;gation de
votre part non autoris&eacute;e est nulle.</p>

<p><b>Clause de divisibilit&eacute;.</b> Vous et Nival reconnaissez que si toute partie des
pr&eacute;sentes Conditions d'utilisation ou de la Politique de
confidentialit&eacute; de Nival est jug&eacute;e ill&eacute;gale ou
inapplicable, en totalit&eacute; ou en partie, par tout tribunal de juridiction
comp&eacute;tente, cette disposition sera, dans le cadre de cette juridiction,
inefficace exclusivement dans la mesure d'une telle d&eacute;termination
d'invalidit&eacute; ou d'inapplicabilit&eacute; sans affecter la
validit&eacute; ou l'applicabilit&eacute;, de quelque autre mani&egrave;re ou
juridiction et sans affecter les dispositions restantes des Conditions, qui
demeurent valides et en vigueur.</p>

<p><b>Politiques suppl&eacute;mentaires.</b> Nival peut publier des politiques
suppl&eacute;mentaires li&eacute;es &agrave; des services sp&eacute;cifiques
tels que des forums, promotions, concours ou programmes de
fid&eacute;lit&eacute;. Par exemple, avant de participer &agrave; nos forums de
jeu, vous devez lire et accepter le R&egrave;glement du forum applicable
&agrave; la communaut&eacute; du Service. Votre droit d'utiliser de tels
Services est soumis &agrave; ces politiques sp&eacute;cifiques et aux
pr&eacute;sentes Conditions d'utilisation. </p>

<p><b>Langue.</b> Les pr&eacute;sentes Conditions d'utilisation et
tous les documents relatifs sont r&eacute;dig&eacute;s et doivent &ecirc;tre
interpr&eacute;t&eacute;s en anglais.</p>

<p><b>Notifications.</b> Nous pouvons vous notifier via des publications sur
www.nival.com, via e-mail ou via tout autre moyen de communication li&eacute;
aux informations de contact fournies. Toutes les notifications l&eacute;gales
officielles qui vous sont adress&eacute;es ou qui sont requises de votre part
en vertu des pr&eacute;sentes Conditions d'utilisation ou de la Politique de confidentialit&eacute;
de Nival doivent &ecirc;tre &eacute;crites et envoy&eacute;es &agrave; Nival
&agrave; l'adresse suivante&nbsp;: Nival, Inc., Attn&nbsp;: General Counsel
(Directeur juridique)&nbsp;; 1920 East Hallandale Beach Blvd., PH-6, Hallandale
Beach, FL 33009 avec une copie &agrave; <a href="mailto:legal@nival.com">legal@nival.com</a>. En cas de communications informelles, contactez-nous par e-mail &agrave; l'adresse&nbsp;: <a href="mailto:legal@nival.com">legal@nival.com.</a></p>

<p><b>Recours &eacute;quitables
accessibles &agrave; Nival.</b> Vous
reconnaissez que les droits accord&eacute;s et les obligations
contract&eacute;es en vertu des pr&eacute;sentes Conditions d'utilisation au
regard de Nival sont de nature unique et irrempla&ccedil;able. Leur perte
causerait un pr&eacute;judice irr&eacute;parable &agrave; Nival et ils ne
peuvent pas &ecirc;tre remplac&eacute;s par des dommages p&eacute;cuniaires
seuls afin que Nival soit en droit de recourir &agrave; des mesures injonctives
ou autres mesures &eacute;quitables (sans obligation de publier une preuve de
bonne foi, de caution ou de l'existence des dommages) en cas de violation ou de
violation anticip&eacute;e de votre part.</p>

<p><b>Votre renonciation &agrave; des
mesures injonctives ou &eacute;quitables.</b> Vous renoncez irr&eacute;vocablement &agrave; tout droit de recourir &agrave;
des mesures injonctives ou &eacute;quitables, de restreindre ou d'interdire le
fonctionnement des Services ou de tout jeu de Nival, d'exploiter toute
publicit&eacute; ou autre mat&eacute;riel diffus&eacute; en lien ou d'exploiter
les Services, tout contenu ou autre mat&eacute;riel utilis&eacute; ou
diffus&eacute; via les Services et vous acceptez de limiter vos plaintes aux
r&eacute;clamations pour dommages p&eacute;cuniaires, limit&eacute;es par la <a href="#section16">Section 16</a>.</p>

<p><b>Survie des dispositions.</b> Les sections et les dispositions qui survivent par
nature &agrave; l'expiration ou &agrave; la r&eacute;siliation des
pr&eacute;sentes Conditions d'utilisation, y compris mais sans s'y limiter la
limitation de garantie, ainsi que les d&eacute;charges et les limites de
responsabilit&eacute;, survivent &agrave; l'expiration ou &agrave; la
r&eacute;siliation.</p>

<p><b>Totalit&eacute; de l'Accord.</b> Les pr&eacute;sentes Conditions d'utilisation,
ainsi que toute autre politique et document express&eacute;ment
incorpor&eacute;s par r&eacute;f&eacute;rence dans les pr&eacute;sentes (y
compris la Politique de confidentialit&eacute; et le Code de conduite de Nival)
contiennent la totalit&eacute; de l'Accord entre vous et Nival et remplacent
toutes les ententes ant&eacute;rieures entre les parties en lien avec l'objet
des pr&eacute;sentes, qu'elles soient &eacute;lectroniques, orales ou
&eacute;crites et qu'elles soient &eacute;tablies selon des usages, des
pratiques, des politiques ou des pr&eacute;c&eacute;dents, entre vous et nous
au regard des Services. Sauf dispositions expresses et explicites dans les
pr&eacute;sentes Conditions d'utilisation, aucune repr&eacute;sentation,
d&eacute;claration, renonciation et aucun consentement ou autre acte ou
omission par Nival ne peut &ecirc;tre consid&eacute;r&eacute; comme une
modification des pr&eacute;sentes ou l&eacute;galement contraignant, sauf en
cas de documentation &eacute;crite et sign&eacute;e &agrave; la main par vous
et par un agent d&ucirc;ment nomm&eacute; de Nival.</p>
</body>
</html>