# -*- coding: cp1251 -*-

#!/usr/bin/env python
#
# (C) Dan Vorobiev 2012, Nival Network

##----------------------------------------------------------------------------------------------------------------------
## общедоступный (внешний) адрес балансера, на который могут ломиться снаружи клиенты
COORDINATOR_BALANCER_EXTERNAL = "127.0.0.1:88"

##----------------------------------------------------------------------------------------------------------------------
## общедоступный (внешний) адрес балансера, на который по SSL могут ломиться клиенты, с запросами к PW Connect
COORDINATOR_BALANCER_PWCONNECT = "127.0.0.1:888"

##----------------------------------------------------------------------------------------------------------------------
## внутренний (закрытый) адрес балансера, на который можно ломиться только изнутри кластера (например, чтобы попасть со служебной командой на свой же чат-сервер)
COORDINATOR_BALANCER_INTERNAL = "127.0.0.1:8888"


##----------------------------------------------------------------------------------------------------------------------
## настройки "активных серверов" [name] -> server_id, port...
COORDINATOR_WS_SERVERS = {
    "ein": { "addr":"127.0.0.1:8811", "on":1, "ka":0 },
    "zwei": { "addr":"127.0.0.1:8812", "on":1, "ka":0 },
}

##----------------------------------------------------------------------------------------------------------------------
## кластерные настройки sql-серверов
COORDINATOR_SQL_CONFIG = [
    { "sql_host":"localhost:3306", "sql_base":"se1", "sql_user":"se", "sql_pass":"sedata" },
]

##----------------------------------------------------------------------------------------------------------------------
## адреса events-сервисов (для начала используем для отправки high-severity логов по http)
COORDINATOR_EVENT_SERVICES = [ "127.0.0.1:8722" ]

##----------------------------------------------------------------------------------------------------------------------
## количество рабочих ниток/коннектов
COORDINATOR_HTTP_CURL_WORKERS = 32
COORDINATOR_HTTP_CURL_CONNECTIONS = 16

COORDINATOR_SQL_THREADS = 2

COORDINATOR_HTTP_REQUEST_LIMIT = 256

COORDINATOR_FRIEND_SERVICES = [ "127.0.0.1:8714", "127.0.0.1:8715" ]
COORDINATOR_GUILD_SERVICES = [ "127.0.0.1:8718", "127.0.0.1:8719" ]
